// Based on https://github.com/pixeltris/SonyAlphaUSB/blob/master/SonyAlphaUSB/WIALogger.cs
// Taken 30th June 2019
using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.IO;
using System.Linq;
using System.Reflection;
using System.Runtime.CompilerServices;
using System.Runtime.InteropServices;
using System.Text;
using System.Threading;

namespace GK6X
{
    // This is a mess, but it's just used for logging packets. It would nice to clean this up, but it probably isn't worth the effort.
    // TODO: At least seperate out the logger parts from the process launcher/injector?
    // NOTE: Lots of limitations here due to hooking functions the .NET Framework wants to use, causing lockups.
    // NOTE: The process launcher will often crash the target process, just keep relaunching it until it works. TODO: Look into the crash.
    internal unsafe class CommandLogger
    {
        const string targetProcessName = "CMS";
        const string targetProcessNameEx = targetProcessName + ".exe";
        const string someFileInTargetProcessFolder = "CGMEngine.dll";
        const string loaderDll = "GK6XLoggerLoader.dll";

        static bool showConsole = true;

        static byte keyboardBufferSizeA;
        static byte keyboardBufferSizeB;
        static uint keyboardFirmwareId;
        static byte keyboardFirmwareMinorVersion;
        static byte keyboardFirmwareMajorVersion;
        static KeyboardState keyboardState;

                [FieldOffset(8)]
                public uint Dr1;
                [FieldOffset(12)]
                public uint Dr2;
                [FieldOffset(16)]
                public uint Dr3;
                [FieldOffset(20)]
                public uint Dr6;
                [FieldOffset(24)]
                public uint Dr7;
                [FieldOffset(28)]
                [MarshalAs(UnmanagedType.Struct)]
                public FloatingSaveArea FloatingSave;
                [FieldOffset(140)]
                public uint SegGs;
                [FieldOffset(144)]
                public uint SegFs;
                [FieldOffset(148)]
                public uint SegEs;
                [FieldOffset(152)]
                public uint SegDs;
                [FieldOffset(156)]
                public uint Edi;
                [FieldOffset(160)]
                public uint Esi;
                [FieldOffset(164)]
                public uint Ebx;
                [FieldOffset(168)]
                public uint Edx;
                [FieldOffset(172)]
                public uint Ecx;
                [FieldOffset(176)]
                public uint Eax;
                [FieldOffset(180)]
                public uint Ebp;
                [FieldOffset(184)]
                public uint Eip;
                [FieldOffset(188)]
                public uint SegCs;
                [FieldOffset(192)]
                public uint EFlags;
                [FieldOffset(196)]
                public uint Esp;
                [FieldOffset(200)]
                public uint SegSs;
                [FieldOffset(204)]
                //[MarshalAs(UnmanagedType.ByValArray, SizeConst = 512)]
                public byte ExtendedRegisters;//public byte[] ExtendedRegisters;
                //716
            }

            [StructLayout(LayoutKind.Explicit, Size = 112)]//0x70
            unsafe struct FloatingSaveArea
            {
                [FieldOffset(0)]//28
                public uint ControlWord;
                [FieldOffset(4)]//32
                public uint StatusWord;
                [FieldOffset(8)]//36
                public uint TagWord;
                [FieldOffset(12)]//40
                public uint ErrorOffset;
                [FieldOffset(16)]//44
                public uint ErrorSelector;
                [FieldOffset(20)]//48
                public uint DataOffset;
                [FieldOffset(24)]//52
                public uint DataSelector;
                [FieldOffset(28)]//56
                //[MarshalAs(UnmanagedType.ByValArray, SizeConst = 80)]
                public byte RegisterArea;//public byte[] RegisterArea;
                [FieldOffset(108)]//136
                public uint Cr0NpxState;
                //140
            }

            /*[StructLayout(LayoutKind.Explicit, Size = 1232)]
            unsafe struct CONTEXT64
            {
                // Register Parameter Home Addresses
                [FieldOffset(0x0)]
                internal ulong P1Home;
                [FieldOffset(0x8)]
                internal ulong P2Home;
                [FieldOffset(0x10)]
                internal ulong P3Home;
                [FieldOffset(0x18)]
                internal ulong P4Home;
                [FieldOffset(0x20)]
                internal ulong P5Home;
                [FieldOffset(0x28)]
                internal ulong P6Home;
                // Control Flags
                [FieldOffset(0x30)]
                internal CONTEXT_FLAGS ContextFlags;
                [FieldOffset(0x34)]
                internal uint MxCsr;
                // Segment Registers and Processor Flags
                [FieldOffset(0x38)]
                internal ushort SegCs;
                [FieldOffset(0x3a)]
                internal ushort SegDs;
                [FieldOffset(0x3c)]
                internal ushort SegEs;
                [FieldOffset(0x3e)]
                internal ushort SegFs;
                [FieldOffset(0x40)]
                internal ushort SegGs;
                [FieldOffset(0x42)]
                internal ushort SegSs;
                [FieldOffset(0x44)]
                internal uint EFlags;
                // Debug Registers
                [FieldOffset(0x48)]
                internal ulong Dr0;
                [FieldOffset(0x50)]
                internal ulong Dr1;
                [FieldOffset(0x58)]
                internal ulong Dr2;
                [FieldOffset(0x60)]
                internal ulong Dr3;
                [FieldOffset(0x68)]
                internal ulong Dr6;
                [FieldOffset(0x70)]
                internal ulong Dr7;
                // Integer Registers
                [FieldOffset(0x78)]
                internal ulong Rax;
                [FieldOffset(0x80)]
                internal ulong Rcx;
                [FieldOffset(0x88)]
                internal ulong Rdx;
                [FieldOffset(0x90)]
                internal ulong Rbx;
                [FieldOffset(0x98)]
                internal ulong Rsp;
                [FieldOffset(0xa0)]
                internal ulong Rbp;
                [FieldOffset(0xa8)]
                internal ulong Rsi;
                [FieldOffset(0xb0)]
                internal ulong Rdi;
                [FieldOffset(0xb8)]
                internal ulong R8;
                [FieldOffset(0xc0)]
                internal ulong R9;
                [FieldOffset(0xc8)]
                internal ulong R10;
                [FieldOffset(0xd0)]
                internal ulong R11;
                [FieldOffset(0xd8)]
                internal ulong R12;
                [FieldOffset(0xe0)]
                internal ulong R13;
                [FieldOffset(0xe8)]
                internal ulong R14;
                [FieldOffset(0xf0)]
                internal ulong R15;
                // Program Counter
                [FieldOffset(0xf8)]
                internal ulong Rip;
                // Floating Point State
                [FieldOffset(0x100)]
                internal ulong FltSave;
                [FieldOffset(0x120)]
                internal ulong Legacy;
                [FieldOffset(0x1a0)]
                internal ulong Xmm0;
                [FieldOffset(0x1b0)]
                internal ulong Xmm1;
                [FieldOffset(0x1c0)]
                internal ulong Xmm2;
                [FieldOffset(0x1d0)]
                internal ulong Xmm3;
                [FieldOffset(0x1e0)]
                internal ulong Xmm4;
                [FieldOffset(0x1f0)]
                internal ulong Xmm5;
                [FieldOffset(0x200)]
                internal ulong Xmm6;
                [FieldOffset(0x210)]
                internal ulong Xmm7;
                [FieldOffset(0x220)]
                internal ulong Xmm8;
                [FieldOffset(0x230)]
                internal ulong Xmm9;
                [FieldOffset(0x240)]
                internal ulong Xmm10;
                [FieldOffset(0x250)]
                internal ulong Xmm11;
                [FieldOffset(0x260)]
                internal ulong Xmm12;
                [FieldOffset(0x270)]
                internal ulong Xmm13;
                [FieldOffset(0x280)]
                internal ulong Xmm14;
                [FieldOffset(0x290)]
                internal ulong Xmm15;
                // Vector Registers
                [FieldOffset(0x300)]
                internal ulong VectorRegister;
                [FieldOffset(0x4a0)]
                internal ulong VectorControl;
                // Special Debug Control Registers
                [FieldOffset(0x4a8)]
                internal ulong DebugControl;
                [FieldOffset(0x4b0)]
                internal ulong LastBranchToRip;
                [FieldOffset(0x4b8)]
                internal ulong LastBranchFromRip;
                [FieldOffset(0x4c0)]
                internal ulong LastExceptionToRip;
                [FieldOffset(0x4c8)]
                internal ulong LastExceptionFromRip;
            }*/

            [Flags]
            enum CONTEXT_FLAGS : uint
            {
                i386 = 0x10000,
                i486 = 0x10000,   //  same as i386
                CONTROL = i386 | 0x01, // SS:SP, CS:IP, FLAGS, BP
                INTEGER = i386 | 0x02, // AX, BX, CX, DX, SI, DI
                SEGMENTS = i386 | 0x04, // DS, ES, FS, GS
                FLOATING_POINT = i386 | 0x08, // 387 state
                DEBUG_REGISTERS = i386 | 0x10, // DB 0-3,6,7
                EXTENDED_REGISTERS = i386 | 0x20, // cpu specific extensions
                FULL = CONTROL | INTEGER | SEGMENTS,
                ALL = CONTROL | INTEGER | SEGMENTS | FLOATING_POINT | DEBUG_REGISTERS | EXTENDED_REGISTERS
            }

            static class DllInjector
            {
                [DllImport("kernel32.dll", SetLastError = true)]
